Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G66A.tmx
Source language: en_us
Languages: zh_cn

source: Why I moved to China
zh_cn: 我为啥来中国

source: After graduating from Arizona State University (ASU), I continued to live near that large campus in Phoenix, Arizona.
zh_cn: 在亚利桑那州立大学（ASU）毕业后，我留在了亚利桑那州菲尼克斯市里，继续住在大校区附近的地方。

source: I'd become a Christian in college and my church would often host events to make foreign exchange students feel at home.
zh_cn: 我成为了一名基督徒，我们的教堂常常举办一些活动来让外国来的交流学生感受到家的感觉。

source: Thousands of international students from all over the world attended ASU, and I enjoyed meeting such a wide variety of people.
zh_cn: 来自全世界成千上万的外国学生来到了亚利桑那州立大学，而我则非常喜欢和各种各样的人交往。

source: But I soon found that I liked the Chinese better than any other people group in the world.
zh_cn: 然而，很快我就发现，比起世界其他地方来的人，我最喜欢中国人。

source: They tend to be humble, polite, intelligent, straightforward, and loyal friends.
zh_cn: 他们常常是谦虚、礼貌、聪明、坦诚和忠实的朋友。

source: I had five close friends who were Chinese in the 1980s, as well as, many acquaintances.
zh_cn: 在八十年代，我有五位非常好的中国朋友，同样也遇到很多其他中国人。

source: In 1983, I heard about the opportunity to teach English in China.
zh_cn: 在1983年，我听说有机会去中国教英语。

source: For two reasons I did not consider the possibility very seriously at that time.
zh_cn: 有两个原因使我没有很认真地考虑成行。

source: I hate travelling, and I hate learning foreign languages.
zh_cn: 一是我讨厌旅行，二是我讨厌学外语。

source: Nevertheless, I took a trip to the Taiwan province in 1989.
zh_cn: 不过，在1989年，我还是去台湾省转了一圈。

source: It was the worst trip of my life.
zh_cn: 这是我一生中最糟糕了旅行了。

source: My best friend and I found that very few people spoke English (we had heard differently).
zh_cn: 我的好友和我发现那里说英语的人少得可怜（我们曾听到的情况不是这样的）。

source: Finding food we could eat without getting sick was even more difficult.
zh_cn: 更难的事情是找到吃了不生病的食物。

source: The trip was only for 18 days, but all 14 of us got sick at least once.
zh_cn: 那次旅行只有18天，但是我们14个人都至少生了一次病。

source: Most of us got sick several times.
zh_cn: 不少人还生了几次病。

source: After that miserable experience, I was convinced that I was not the type of person who should ever wander far from home.
zh_cn: 在那次悲惨的经历之后，我深信自己绝对不是那种可以离家很远的人。

source: Not until February of 2002, did I even think about returning to China for a moment.
zh_cn: 一直到2002年2月，我一刻都没有想过要回到中国。

source: At that time, I read the biography of Berlitz-- the guy who discovered the principle that the best way to teach a foreign language is to speak only in the language you are teaching.
zh_cn: 那时，我在读伯利茨(Berlitz)的自传，他发现教外语的最好方法就是只说你教的那门语言。

source: It occurred to me that I could teach English in China without having to learn Chinese.
zh_cn: 于是，我意识到我可以不学中文就去中国教英语了。

source: The bad experience 13 years earlier was still fresh in my mind, but it did not keep me from considering another trip.
zh_cn: 13年前的糟糕经历仍然历历在目，但是它没有阻止我考虑下一次旅行。

source: For four months, I did not mention my thoughts to anyone.
zh_cn: 整整4个月，我都没有把这个想法告诉任何人。

source: Then on June 28th of 2002 I was at the home of my friend Kristin. I told her that I was thinking about teaching English in China for one month in the summer of 2003.
zh_cn: 直到2002年6月28日，当时我在我朋友克里斯丁(Kristin)家里，我告诉她我想在2003年夏天到中国教一个月英语去。

source: Kristin told me to look at the website of an organization that sent people to China.
zh_cn: 克里斯丁告诉我一个网址，是一个专门派人去中国的组织的网站。

source: When I got home that night, I looked at ESEC on the internet.
zh_cn: 当晚回家后，我便上网查看了ESEC（注1）的网站。

source: My interest grew stronger, and I called them the next morning.
zh_cn: 我的兴致更高了，第二天一早就联系了他们。

source: When I told the girl what I had in mind for the following summer, she said, "Well, we need someone to teach for a whole year, but you'd have to leave in three weeks."
zh_cn: 当我告诉那女孩我明年夏天打算的时候，她说：“不错，我们需要有人来教一整年，但是你三周之后就要成行了。”

source: Instantly, I felt as though God put it on my heart that I should go.
zh_cn: 顿时，我觉得上帝告诉我应该去。

source: I've never felt anything like that before or since.
zh_cn: 以前或之后，我都没有过那样的感觉了。

source: I am a careful planner, and I rarely do anything spontaneously.
zh_cn: 我是一个细心地规划者，很少会一时兴起去做什么事情。

source: Before her question, I never thought that I might go to China for more than just a short trip.
zh_cn: 在她提问之前，我从没想过我会在中国待上比短时旅行更长的时间。

source: But suddenly I felt perfectly peaceful about moving to China permanently.
zh_cn: 但是突然间，我对于长期居住在中国的想法感到非常正常。

source: I paused briefly, before I replied, "That sounds good, I think I want to do that.
zh_cn: 我停顿了一会，然后回复说：“蛮好的，我想去。

source: I can't say for certain, but let's set up a phone interview for Monday."
zh_cn: 我还不能完全确定，不过我们可以在周一进行一次电话面试。”

source: I didn't need to think about it until Monday.
zh_cn: 我根本不需要到周一才想好决定。

source: I thought it over for about an hour, and decided to get rid of most of my belongings and move to China.
zh_cn: 我仔细考虑了一个小时，接着就决定抛下我大部分的财物并移居到中国去。

source: I had sold my condominium about a month before that eventful phone call.
zh_cn: 在那个重要的电话前一个月，我就已经卖掉了自己的房子。

source: All I had to do was move up the closing date, which the buyer had already requested anyway.
zh_cn: 我要做的就是像买家要求的那样，在截止日期前搬出房子。

source: I had very little time to prepare for the big move.
zh_cn: 留给我完全搬家走人的时间很有限。

source: I gave away over $10,000 worth of my personal belongings.
zh_cn: 我扔掉了价值约1万美元的个人财物。

source: Someone had offered to buy my business earlier, but I could not contact them, so I simply closed it down.
zh_cn: 有人想接管我的生意，但是我们没有联系到他们，所以我只能直接关门大吉。

source: On July 19th, I went to Los Angeles for five weeks of training, which proved to be extremely helpful.
zh_cn: 7月19日，我去洛杉矶接受5周的培训。这次培训让我受益匪浅。

source: I met an 82 year old woman at training who had returned from her 13th year of teaching in China.
zh_cn: 在培训中，我遇到了一位82岁的老太太，她在中国教书满13年后刚回来。

source: After a brief talk with her, I made it my goal to teach in China until I am at least 84 years old.
zh_cn: 和她简单地谈了一会后，我决定自己要在中国一直教到84岁。

source: I was 42 when I spoke with her, and I hoped to spend the next 42 years teaching in China.
zh_cn: 和她谈话的时候，我是42岁，而我希望的就是把接下来的42年全投入到在中国教书上。

source: China is home now.
zh_cn: 中国现在就是我的家。

source: When I arrived in Shanghai on August 28, 2002, my expectations were quite low.
zh_cn: 当我在2002年8月28日到达上海的时候，我的期望值并不高。

source: I thought the adjustment would be the toughest challenge of my life.
zh_cn: 我本以为开始的适应期会是我生命中最艰难的挑战。

source: But my life in China has been almost pure bliss.
zh_cn: 但是我在中国的生活其实充满了惬意和顺利。

source: Of course, there have been minor difficulties, but my life in China is far superior to the life I left behind.
zh_cn: 当然，会有一些小麻烦，但是我在中国的生活比起以前在美国要好多了。

source: There was nothing worth mentioning about adjusting to life in China.
zh_cn: 所以关于适应在中国的生活其实没啥好说的。

source: My friendships here are so rich that nothing else bothers me much.
zh_cn: 我在这里广交好友，因此我都碰不上什么麻烦事。

source: In fact, the worst culture shock I have experienced was the reverse culture shock of my first summer visit to the states.
zh_cn: 事实上，我感受到的最强烈的文化冲击，是我第一次暑假回到美国后经历的反向文化冲击。

source: Now I've learned that it is natural for me to feel somewhat out of place when I visit the states, so it does not bother me anymore.
zh_cn: 现在我知道，当我回到美国后感到有些不对劲是很自然的事情，所以我也不再为此烦恼了。
